from pattern2 import P


num = P.anyc('1234567890')


nopunc = P.nic('，。、')


hosp = P.tag(
    P.n(nopunc, 3, 12) + P.anyc('院心') + P.n01('附属' + P.n(P.ANYCHAR, 3, 10) + P.anyc('院心')),
    tag='医院')


date = P.n(num, 2, 4) + P.anyc('-.年') + P.n(num, 1, 2) + P.any(',.月') + P.n01(P.n(num, 1, 2) + '日')


event = P.any('胸部CT', ('PET' + P.n01('-') + 'CT'), '增强CT', '胸部平扫', '肠镜', '穿刺', 'B超')


ptn = P.tag('当地医院', tag='医院') \
    | ('就' + P.any('诊', '医') + P.n01('于') + hosp) \
    | (P.anyc('到至在于往') + P.n01(date)) \
    | (P.n01(date) + hosp + event + P.n(nopunc, 0, 4) + '示') \
    | (P.anyc('到至在于往') + hosp + '体检') \
    | ('入住' + hosp) \
    | (P.anyc('到至在于往') + P.n01(date) + hosp + P.n(nopunc, 0, 3) + P.anyc('行查检'))



# example = '患者于2019-6-26在浙二医院行“右侧甲状腺癌扩大根治术（右侧甲状腺及峡部切除术）+双侧6区清扫+右侧2-5区淋巴结+左侧甲状腺全切除术”，术后病理示“右侧甲状腺：乳头状癌，大小3*2cm，左侧甲状腺：甲状腺组织，左中央区淋巴结：1/2，右侧中央区淋巴结：4/6，右喉返神经后方：0/2，右侧近入喉处淋巴结：1/1，左侧4区淋巴结：0/18，左侧5区：0/4，右侧2A区：0/3，右侧3区：5/7，右侧4区：1/6，右侧5B区：4/11”（2019-31709）术后恢复可，术后每日口服优甲乐125ug替代抑制治疗，无不适，后为进一步诊治，患者来我院要求碘治疗，遂于2019-8-7开始停用“优甲乐”及忌碘饮食至今，无饮水呛咳、无明显畏寒发热、无明显声音嘶哑、无手足麻木抽搐、无胸闷气急、无腹痛腹胀等不适，今入住我科。\r\n患者病来精神可，胃纳佳，睡眠可，二便无殊，体重无明显增减。 \r\n'
example = '就诊于浙二医院'


import pdb; pdb.set_trace()
pt = ptn.search(example)
for p in pt:
    print(p)
